[
  {
    "user": "U0HG4PC7Q",
    "subtype": "channel_join",
    "text": "<@U0HG4PC7Q|metalwihen> has joined the channel",
    "ts": "1451466950.000505",
    "id": "30be1817",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0GTB5N5D",
    "text": "Hi guys! I have a few questions regarding ladies learning programming:\n1) Does the UK government or some organizations provide grants or scholarships for ladies who want to learn programming?\n2) are there any schools/companies focused on teaching back-end development?\n3) what are the most valued programming development programs in London (e.g schools, private companies) based on demand/hiring success rate?\n4) Do you know any private mentors who are focused on back-end development? What are their fees?\nThank you!!!",
    "ts": "1451504845.000506",
    "id": "30be1818",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0HFHHBV4",
    "text": "Hello all!! Anyone have any thoughts about getting past the beginner phase? I've gone through several training courses CodeAcademy, Treehouse, YouTube, Udacity, Udemy. Every time I feel like I'm taking a few steps back by starting over but I'm also learning something new from each course.  (eg. It wasn't until my third course that I really understood that a method call like setText() was a method like any other but defined elsewhere.) (eg2. Didn't understand for the longest time what @Override meant!)  So now I'm wanting to make my own app instead of just following along and I'm really stuck at this is what I want to accomplish, but I'm not sure what Views, API's, etc are the best to get me there.",
    "ts": "1451509904.000507",
    "id": "30be1819",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]