[
  {
    "user": "U04U5KS3Z",
    "text": "<https://techcrunch.com/2016/11/30/aws-announces-virtual-private-servers-starting-at-5-a-month>",
    "attachments": [
      {
        "service_name": "TechCrunch",
        "service_url": "http://techcrunch.com",
        "title": "AWS announces virtual private servers starting at $5 a month",
        "title_link": "https://techcrunch.com/2016/11/30/aws-announces-virtual-private-servers-starting-at-5-a-month",
        "author_name": "Ron Miller",
        "thumb_url": "https://i2.wp.com/tctechcrunch2011.files.wordpress.com/2016/11/screen-shot-2016-11-30-at-11-35-02-am.png?fit=200%2C150&ssl=1",
        "thumb_width": 200,
        "thumb_height": 110,
        "text": "AWS fired a shot across Digital Ocean&rsquo;s bow this morning at the AWS re:Invent conference when it announced new virtual private servers starting at just $5 a month.\nThe VPS service, called Lightsail, allows a customer to easily fire up a server in the cloud for a low price and hide the complexity of the underlying services being used. It&rsquo;s been designed, according to AWS CEO Andy Jassy to let customers who don&rsquo;t want to deal with any of the technical details to fire up servers as needed.\nAccording to Jassy, it&rsquo;s just a matter of choosing from a menu of options starting with your choice of operating system such as Ubuntu, then choosing from five pre-defined bundles that include the compute, storage, memory and so forth you want to run on your VPS. Finally, you just give it a name and you&rsquo;re good to go.\nIt handles all of the technical details such as launching the virtual machine, attaching the storage, setting up security groups and so forth &mdash; &nbsp;removing a huge barrier to entry for less technical&nbsp;users.\nDan Scholnick, a partner at Trinity Ventures, says this announcement&nbsp;shows AWS is moving into&nbsp;a variety of markets. &ldquo;They are ferociously protective of their turf and are moving aggressively to shore up any part of their business that might be vulnerable to competitors. In recent years there has been a lot of talk of Amazon&rsquo;s move into the enterprise. With this announcement, they are defending their flank and the original core of their business, which is to serve developers with low cost products,&rdquo;&nbsp;Scholnick told TechCrunch.\nFor companies, departments or even individuals who are looking to launch servers quickly without fuss, this removes layers of complexity. It won&rsquo;t be for everyone. Certainly folks who have a technical background, and have more specific requirements will want more control over their choices, but for those people who are looking for speed and simplicity, this product group should be a great match, especially given the potentially low startup costs.",
        "fallback": "TechCrunch Link: AWS announces virtual private servers starting at $5 a&nbsp;month",
        "from_url": "https://techcrunch.com/2016/11/30/aws-announces-virtual-private-servers-starting-at-5-a-month",
        "service_icon": "https://s0.wp.com/wp-content/themes/vip/techcrunch-2013/assets/images/favicon.ico",
        "id": 1
      }
    ],
    "ts": "1480527541.001186",
    "reactions": [
      {
        "name": "downvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      },
      {
        "name": "upvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      }
    ],
    "id": "30ha6544",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U061HDV96",
    "text": "<@U04U5KS3Z> that looks interesting for moving to AWS slowly.",
    "edited": {
      "user": "U061HDV96",
      "ts": "1480532419.000000"
    },
    "ts": "1480532417.001188",
    "id": "30ha6545",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]