[
  {
    "user": "U0546QERR",
    "text": "this was a good podcast, didn’t know about this podcast until this episode but i’m definitely going to listen to more <http://theblerg.net/podcast/13>",
    "attachments": [
      {
        "service_name": "The Blerg",
        "title": "13: :books:The history of Link Bubble with Jake Wharton",
        "title_link": "http://theblerg.net/podcast/13",
        "text": "Download MP3 | Subscribe Jake Wharton (aka the most in-demand Android engineer on the planet) takes over the show and proceeds to interview yours truly about all things Link Bubble, my now former app. We discuss everything about Link Bubble, from how I conceived the app all the way up to my selling of the app and everything in between. Some of the many topics discussed include the early prototyping of the app, my decision making process in applying for a patent on the app, my thoughts on the vocal folk who felt the app was outrageously priced at launch, the companion app TapPath, what it was like for me to temporarily trade in my engineering hat and try my hand at becoming a deal making executive, and a whole heap more. This episode is brought to you by Action Launcher 3 for Android. Go on, leave me a review (I like the number 5). Follow Jake on Twitter: @JakeWharton Links * The \"directors cut\" episode of The Blerg where guest Jesse Wilson and I discuss the Action Launcher 3.5 update. * My announcement post of Link Bubble and TapPath's sale. * Brian R. Bondy's announcement that all of Link Bubble's features are available for free for everyone. * My initial teaser post about Link Bubble's release. * My launch day post in response to the \"this app is too expensive\" commenters.",
        "fallback": "The Blerg: 13: 📚The history of Link Bubble with Jake Wharton",
        "image_url": "https://static1.squarespace.com/static/559ca9fce4b0015f541296e6/t/559e4b0be4b0a62da01194f5/1441949372648/?format=1000w",
        "from_url": "http://theblerg.net/podcast/13",
        "image_width": 250,
        "image_height": 250,
        "image_bytes": 136092,
        "id": 1
      }
    ],
    "ts": "1442005113.000526",
    "reactions": [
      {
        "name": "+1",
        "users": [
          "U054L79RL"
        ],
        "count": 1
      }
    ],
    "id": "11de9042",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0546QERR",
    "text": "also didn’t realize Link Bubble was such a big deal",
    "ts": "1442005125.000528",
    "id": "11de9043",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]