[
  {
    "user": "U061HDV96",
    "text": "Pathfinder team haha",
    "ts": "1485522118.000270",
    "id": "27ga771",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U061HDV96",
    "text": "<https://en.wikipedia.org/wiki/Mars_Pathfinder>",
    "attachments": [
      {
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/2001_mars_odyssey_wizja.jpg",
        "image_width": 5824,
        "image_height": 4737,
        "image_bytes": 3012435,
        "title": "Mars Pathfinder",
        "title_link": "https://en.wikipedia.org/wiki/Mars_Pathfinder",
        "author_name": "Wikipedia",
        "author_link": "http://en.wikipedia.org/",
        "text": "Mars Pathfinder (MESUR Pathfinder) is an American robotic spacecraft that landed a base station with a roving probe on Mars in 1997. It consisted of a lander, renamed the Carl Sagan Memorial Station, and a lightweight (10.6 kg/23 lb) wheeled robotic Mars rover named Sojourner, which became the first rover to operate outside the Earth-Moon system.\nLaunched on December 4, 1996 by NASA aboard a Delta II booster a month after the Mars Global Surveyor was launched, it landed on July 4, 1997 on Mars's Ares Vallis, in a region called Chryse Planitia in the Oxia Palus quadrangle. The lander then opened, exposing the rover which conducted many experiments on the Martian surface. The mission carried a series of scientific instruments to analyze the Martian atmosphere, climate, geology and the composition of its rocks and soil. It was the second project from NASA's Discovery Program, which promotes the use of low-cost spacecraft and frequent launches under the motto \"cheaper, faster and better\" promoted by the then administrator, Daniel Goldin. The mission was directed by the Jet Propulsion Laboratory (JPL), a division of the California Institute of Technology, responsible for NASA's Mars Exploration Program. The project manager was JPL's Tony Spear.\nThis mission was the first of a series of missions to Mars that included rovers, and was the first successful lander since the two Vikings landed on the red planet in 1976. Although the Soviet Union successfully sent rovers to the Moon as part of the Lunokhod program in the 1970s, its attempts to use rovers in its Mars program failed.\nIn addition to scientific objectives, the Mars Pathfinder mission was also a \"proof-of-concept\" for various technologies, such as airbag-mediated touchdown and automated obstacle avoidance, both later exploited by the Mars Exploration Rover mission. The Mars Pathfinder was also remarkable for its extremely low cost relative to other unmanned space missions to Mars. Originally, the mission was conceived as the first of the Mars Environmental Survey (MESUR) program.",
        "fallback": "wikipedia: Mars Pathfinder",
        "service_icon": "https://a.slack-edge.com/bfaba/img/unfurl_icons/wikipedia.png",
        "id": 1
      }
    ],
    "ts": "1485522133.000271",
    "reactions": [
      {
        "name": "upvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      },
      {
        "name": "downvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      }
    ],
    "id": "27ga772",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U061HDV96",
    "text": "<@U053PPGDC> looks pretty amazing though",
    "ts": "1485522204.000273",
    "id": "27ga773",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U061HDV96",
    "text": "Looks like a movie",
    "ts": "1485522206.000274",
    "id": "27ga774",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U3XGFJCVC",
    "text": "<@U3XGFJCVC|callmecake> has joined the channel",
    "subtype": "channel_join",
    "ts": "1485545099.000275",
    "id": "27ga775",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]