[
  {
    "user": "U04U5KS3Z",
    "text": "<@U08GFT5V5> you’ll get a kick out of this - <http://lessig.tumblr.com/post/75701323521/pelosis-great-day-pelosis-great-opportunity>",
    "attachments": [
      {
        "service_name": "LESSIG Blog, v2",
        "title": "Pelosi’s great day; Pelosi’s great opportunity: Listen to Paul Wellstone",
        "title_link": "http://lessig.tumblr.com/post/75701323521/pelosis-great-day-pelosis-great-opportunity",
        "text": "Today, House Minority Leader Nancy Pelosi (D-CA)  stands with House hero, John Sarbanes (D-MD), to introduce the Government By the People Act. After years of struggling, finally the Democrats (and at least one Republican) have lined up behind a fundamental reform of the campaign finance system. Small bore is out; fundamental reform is in. Congratulations to the Leader, and all who pushed the Democrats to lead (and at the very top of that list is Arnold Hiatt who has been fighting this fight for more than 18 years — see the story in the last chapter of Republic, Lost). But a nagging bit to this debate remains: What is the problem that the Government By the People Act is meant to solve?Last Thursday, Jon Stewart called it “corruption.” But Leader Pelosi denied it. “The system isn’t corrupt,” she told Stewart. “There is corruption in the system …” (watch beginning circa 5:50) The Daily Show Get More: Daily Show Full Episodes,The Daily Show on Facebook I can’t for the life of me understand why this incredible woman continues to insist on calling pure a system which obviously is not. Why, in other words, she insists on believing that the only way to use the word “corruption” is to speak of corrupt individuals. But it seems that since time immemorial, Members of Congress (and the Supreme Court: see the upcoming decision in McCutcheon v. FEC) have been divided between those who see corruption in the system, and those who think the only kind of corruption possible is the corruption of individuals.  Senator McConnell — like Pelosi? and Justice Scalia? — is a corruption skeptic. Here he is in October, 1999, on the floor of the Senate, challenging John McCain who had begun to frame his presidential campaign around the “corruption” of “the system”:  McCain v. McConnell (4) from lessig on Vimeo. McCain responded in what to these ears sounds like a perfectly true reply:  McCain v. McConnell on Corruption (1) from lessig on Vimeo But McConnell (at least acts as if he) didn’t understand it. He asks again (and here you see him trying out for a part in Austin Powers):  McCain v. McConnell (3) from lessig on Vimeo McCain loses his patience for a second (“either the Senator from Kentucky did not listen to what I said…”) but then recovers beautifully:  McCain v. McConnell (2) from lessig on Vimeo And then Senator Fred Thompson (R-TN) tries focus the debate with a great question — leading McConnell to a classic “oops-not-really-what-I-meant-to-say” moment (“I’m extremely grateful that these companies are giving us the opportunity to engage in vote buying” [sic]) McConnell on Votebuying (oops) from lessig on Vimeo But no one makes this point more clearly and powerfully than the late Senator Paul Wellstone (D-MN), as he responds to the squabble between McCain and McConnell about the meaning of the word “corruption.” And this is the clip that the Minority Leader really needs to watch:  Wellstone on the meaning of “corruption” from lessig on Vimeo Amen, brother. We miss you. We need more to listen to your words.",
        "fallback": "LESSIG Blog, v2: Pelosi’s great day; Pelosi’s great opportunity: Listen to Paul Wellstone",
        "from_url": "http://lessig.tumblr.com/post/75701323521/pelosis-great-day-pelosis-great-opportunity",
        "thumb_url": "http://66.media.tumblr.com/avatar_b7acab00d9fd_64.png",
        "thumb_width": 64,
        "thumb_height": 64,
        "service_icon": "http://67.media.tumblr.com/avatar_b7acab00d9fd_128.png",
        "id": 1
      }
    ],
    "ts": "1479898844.001438",
    "reactions": [
      {
        "name": "downvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      },
      {
        "name": "upvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      }
    ],
    "id": "23po6829",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U053LEHJN",
    "text": "lulz",
    "ts": "1479924503.001440",
    "id": "23po6830",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]