[
  {
    "user": "U08GFT5V5",
    "text": "So the “Don’t be evil” part of Google is officially over",
    "ts": "1465635756.000004",
    "id": "11po3044",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "<https://publicpolicy.googleblog.com/2016/06/the-trans-pacific-partnership-step.html>",
    "ts": "1465635762.000005",
    "reactions": [
      {
        "name": "upvote",
        "users": [
          "U0N7D6F50",
          "U061HDV96"
        ],
        "count": 2
      },
      {
        "name": "downvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      },
      {
        "name": "evil",
        "users": [
          "U04U5KS3Z"
        ],
        "count": 1
      }
    ],
    "id": "11po3045",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "They are endorsing the TPP",
    "ts": "1465635783.000006",
    "id": "11po3046",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U055GGAHS",
    "text": "Lame",
    "ts": "1465636804.000007",
    "id": "11po3047",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U061HDV96",
    "text": "<@U08GFT5V5>: yes yes yes yes yes",
    "edited": {
      "user": "U061HDV96",
      "ts": "1465643967.000000"
    },
    "ts": "1465643961.000002",
    "id": "11po3048",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0548MM6B",
    "text": "would love to hear what exactly sucks about this deal except that some euphoric redditors don’t like it (probably impacts price of cheetos)",
    "ts": "1465649732.000004",
    "id": "11po3049",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "<@U0548MM6B>: <https://www.eff.org/issues/tpp>",
    "attachments": [
      {
        "service_name": "Electronic Frontier Foundation",
        "title": "Trans-Pacific Partnership Agreement",
        "title_link": "https://www.eff.org/issues/tpp",
        "text": "What Is the Trans-Pacific Partnership Agreement (TPP)? The Trans-Pacific Partnership (TPP) is a secretive, multinational trade agreement that threatens to extend restrictive intellectual property (IP) laws across the globe and rewrite international rules on its enforcement. The main problems are two-fold: (1) Digital Policies that Benefit Big Corporations at the Expense of the Public: The IP chapter would have extensive negative ramifications for users’ freedom of expression, right to privacy and due process, as well as hindering peoples' abilities to innovate. Other chapters of the agreement encourage your personal data to be sent borders with limited protection for your privacy, and allow foreign corporations to sue countries for laws or regulations that promote the public interest, (2) Lack of Transparency: The entire process has shut out multi-stakeholder participation and is shrouded in secrecy. The twelve nations that negotiated the TPP are the U.S., Japan, Australia, Peru, Malaysia, Vietnam, New Zealand, Chile, Singapore, Canada, Mexico, and Brunei Darussalam. The TPP contains a chapter on intellectual property covering copyright, trademarks, and patents. The official release of the final TPP text confirmed what we had long feared: that U.S. negotiators pushed for the adoption of copyright measures far more restrictive than currently required by international treaties, including the controversial Anti-Counterfeiting Trade Agreement (ACTA). The TPP Will Rewrite Global Rules on Intellectual Property Enforcement All signatory countries will be required to conform their domestic laws and policies to the provisions of the Agreement. In the U.S., this will further entrench controversial aspects of U.S. copyright law—such as the Digital Millennium Copyright Act (DMCA)—and restrict the ability of Congress to engage in domestic law reform to meet the evolving needs of American citizens and the innovative technology sector. Overall, the TPP's provisions that recognize the rights of the public are non-binding, whereas almost everything that benefits rightsholders is binding. The final IP chapter includes many detailed requirements that are more restrictive than current international standards, and would require significant changes to other countries’ copyright laws. These include obligations for countries to: Expand Copyright Terms: Create copyright terms well beyond the internationally agreed period in the 1994 Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS). The TPP could extend copyright term protections from life of the author + 50 years, to Life + 70 years for works created by individuals, and 70 years after publication or after creation for corporate owned works (such as Mickey Mouse). Escalate Protections for DRM (aka Digital Locks): It will compel signatory nations to enact laws banning circumvention of digital locks (technological protection measures or TPMs) [PDF] that mirror the DMCA and treat violation of the TPM provisions as a separate offense even when no copyright infringement is involved. This would require countries like New Zealand to completely rewrite its innovative 2008 copyright law, as well as override Australia’s carefully-crafted 2007 TPM regime exclusions for region-coding on movies on DVDs, video games, and players, and for embedded software in devices that restrict access to goods and services for the device—a thoughtful effort by Australian policy makers to avoid the pitfalls experienced with the U.S. digital locks provisions. In the U.S., b business competitors have used the DMCA to try to block printer cartridge refill services, competing garage door openers, and to lock mobile phones to particular network providers. Create New Threats for Journalists and Whistleblowers: Dangerously vague text on the misuse of trade secrets, which could be used to enact harsh criminal punishments against anyone who reveals or even accesses information through a \"computer system\" that is allegedly confidential. Enact a \"Three-Step Test\" Language That Puts Restrictions on Fair Use: The U.S. Trade Representative (USTR) is putting fair use at risk with restrictive language in the TPP's IP chapter. Companies that adopt more user-friendly rules could also risk lawsuits by content industry investors who believe these rules limit their profits. Place Greater Liability on Internet Intermediaries: The TPP would force the adoption of the U.S. DMCA Internet intermediaries copyright safe harbor regime in its entirety on other countries. Chile and Canada have gotten exceptions to allow their forward-thinking regimes that better safeguard user rights to stay in place. However, the TPP would still help entrench the United States' flawed takedown regime as an international standard. Adopt Heavy Criminal Sanctions: Adopt criminal sanctions for copyright infringement that is done without commercial motivation. Users could be jailed or hit with debilitating fines over file sharing, and may have their property or domains seized or destroyed even without a formal complaint from the copyright holder. In short, countries would have to abandon any efforts to learn from the mistakes of the United States and its experience with the DMCA over the last 16 years, and adopt many of the most controversial aspects of U.S. copyright law in their entirety. At the same time, the TPP's IP chapter does not export the limitations and exceptions in the U.S. copyright regime like fair use, which have enabled freedom of expression and technological innovation to flourish in the United States. It includes only a placeholder for exceptions and limitations. This raises serious concerns about other countries’ sovereignty and the ability of national governments to set laws and policies to meet their domestic priorities. Although the IP chapter contains the worst of the agreement's anti-user provisions, we are also concerned by provisions elsewhere that: Place Barriers in the Way of Protecting Your Privacy: The TPP's Electronic Commerce and Telecommunications Chapters establish only the weakest baseline for the protection of your private data—even enforcing self-regulation by the companies that profit from your data is enough. On the other hand, stronger privacy laws are outlawed if they amount to an “arbitrary or unjustifiable discrimination or a disguised restriction on trade.” Do Nothing on Net Neutrality and Spam: The TPP includes provisions on net neutrality and spam control that are so weak that they achieve nothing. But including them in the agreement at all could lead countries to wrongly assume that these topics have been adequately dealt with, dissuading them from working towards more positive solutions. Prohibit Open Source Mandates: With no good rationale, the agreement would outlaw a country from adopting rules for the sale of software that include mandatory code review or the release of source code. This could inhibit countries from addressing pressing information security problems, such as widespread and massive vulnerability in closed-source home routers. Why You Should Care TPP raises significant concerns about citizens’ freedom of expression, due process, innovation, the future of the Internet’s global infrastructure, and the right of sovereign nations to develop policies and laws that best meet their domestic priorities. In sum, the TPP puts at risk some of the most fundamental rights that enable access to knowledge for the world’s citizens. The U.S. Trade Representative (USTR) has pursued a TPP agreement that will require signatory countieies to adopt heightened copyright protection that advances the agenda of the U.S. entertainment and pharmaceutical industries agendas, but omits the flexibilities and exceptions that protect Internet users and technology innovators. The TPP will affect countries beyond the twelve that are currently involved in negotiations. Like ACTA, the TPP Agreement is a plurilateral agreement that will be used to create new heightened global IP enforcement norms. Countries that are not parties to the negotiation will likely be asked to accede to the TPP as a condition of bilateral trade agreements with the U.S. and other TPP members, or evaluated against the TPP's copyright enforcement standards in the USTR's annual Special 301 process. What You Can Do Are you in the United States? Take action now and call on your Congress members to hold congressional hearings about the contents of the TPP immediately, and demand that they reject the deal when the agreement comes up for an eventual ratification vote: For more information on other problematic aspects of the TPP, visit Public Citizen’s resource page. Actions Around the World If you're in Canada, and use the Let's Talk TPP platform to send comments to officials about why you oppose the agreement. Also visit the Council of Canadians' website to petition Prime Minister Justin Trudeau to reject the TPP. If you're in Australia, you can use GetUp!'s action too to contact your senator and call on them to oppose the agreement in the Senate. 日本に住んでいる方には、Stop TPP!! ウェブページでご案内できますし、Stop TPPのT−シャツを買う事もできます。 Share this page on Twitter by clicking here. If you have other campaigns you would like to see listed here, please contact us!",
        "fallback": "Electronic Frontier Foundation: Trans-Pacific Partnership Agreement",
        "thumb_url": "https://www.eff.org/files/2015/03/02/eff-og-3.png",
        "from_url": "https://www.eff.org/issues/tpp",
        "thumb_width": 1200,
        "thumb_height": 630,
        "service_icon": "https://www.eff.org/sites/all/themes/frontier/favicon.ico",
        "id": 1
      }
    ],
    "ts": "1465650341.000005",
    "reactions": [
      {
        "name": "upvote",
        "users": [
          "U0N7D6F50",
          "U04U5KS3Z"
        ],
        "count": 2
      },
      {
        "name": "downvote",
        "users": [
          "U0N7D6F50"
        ],
        "count": 1
      }
    ],
    "id": "11po3050",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "Similar sh*t to NAFTA",
    "ts": "1465650380.000007",
    "id": "11po3051",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0548MM6B",
    "text": "<@U08GFT5V5>: ty",
    "ts": "1465650885.000008",
    "id": "11po3052",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0548MM6B",
    "text": "wonder how big the TPP is, might go ahead and read it",
    "edited": {
      "user": "U0548MM6B",
      "ts": "1465651018.000000"
    },
    "ts": "1465651006.000009",
    "id": "11po3053",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0H67LJUA",
    "text": "But is is so much more easy to not read, and just hate it without a reason:P",
    "ts": "1465651488.000011",
    "id": "11po3054",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "Pretty big",
    "ts": "1465651489.000012",
    "id": "11po3055",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U08GFT5V5",
    "text": "Also complicated legalese",
    "ts": "1465651506.000013",
    "id": "11po3056",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  },
  {
    "user": "U0548MM6B",
    "text": "If I can handle hundreds of pages od European legalese, I bet I can handle US/English (Simplified) :stuck_out_tongue: ",
    "ts": "1465654040.000014",
    "id": "11po3057",
    "thread": [
      {
        "position": "null",
        "number": 0
      }
    ],
    "label": [
      {
        "type": "null",
        "position": "null"
      }
    ]
  }
]